tap "adoptopenjdk/openjdk"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Language for application scale JavaScript development
brew "typescript"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk15"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "MeshIntelligentTechnologiesInc.pieces-vscode"
vscode "ms-vscode.Theme-TomorrowKit"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.LiveServer"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
